app/controllers/categories_controller.rb

  def index
    @session = session[:user_id]
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def update
    @category.update(category_params)
---
UPDATE `categories` SET `slug` = 'une-categorie-de-test' WHERE `categories`.`id` = 1

  def destroy
    @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 3

  def create
    @category = Category.create(category_params)
---
INSERT INTO `categories` (`title`, `slug`) VALUES ('Javascript', 'javascript')

  def set_category
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (NULL, NULL)