app/controllers/posts_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (5, 4)
SELECT `posts`.* FROM `posts`
---
  def index
  	@posts = Post.includes(:category).all

UPDATE `posts` SET `slug` = 'nouveau-membre-sur-le-site', `image_file_name` = '20160919_164929.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 2564608, `image_updated_at` = '2017-02-07 17:05:22' WHERE `posts`.`id` = 7
---
  def update
  	if @post.update(post_params)

INSERT INTO `posts` (`title`, `content`, `category_id`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `user_id`) VALUES ('Optimisé le référencement de votre site Web', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.', 1, 'referencement.png', 'image/png', 91118, '2017-03-03 15:55:46', 1)
---
  def create
  	post = Post.create(post_params)